atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/socket_driver.c
            if ((evt == NETCONN_EVT_SENDMINUS) || (evt == NETCONN_EVT_SENDPLUS)) {
                TRACE("Ignoring SENDMINUS/SENDPLUS event\n");
                continue;
            }

            if (evt == NETCONN_EVT_ERROR) {
                TRACE("Ignoring ERROR event\n");
                continue;
            }

            socket->avail_bytes += len;

            switch (socket->type) {
                case TCPServerSocket:
                    tcp_server_handler(glb, socket->process_id);
                    break;

                case TCPClientSocket:
                    tcp_client_handler(glb, socket->process_id);
                    break;

                case UDPSocket:
                    udp_handler(glb, socket->process_id);
                    break;

                default:
                    fprintf(stderr, "bug: unknown socket type.\n");
            }

        } else {
            TRACE("Got event for unknown conn: %p, evt: %i, len: %i\n", (void *) netconn, (int) evt, (int) len);
        }
    }
    return listener;
}

void socket_driver_init(GlobalContext *glb)
{
    TRACE("Initializing socket driver\n");

    netconn_events = xQueueCreate(32, sizeof(struct NetconnEvent));
    EventListener *socket_listener = malloc(sizeof(EventListener));

    struct ESP32PlatformData *platform = glb->platform_data;
    socket_listener->sender = netconn_events;
    socket_listener->handler = socket_events_handler;
    synclist_append(&platform->listeners, &socket_listener->listeners_list_head);

    list_init(&platform->sockets_list_head);

    TRACE("Socket driver init: done\n");
}

static void socket_data_init(struct SocketData *data, Context *ctx, struct netconn *conn,
    enum socket_type type, struct ESP32PlatformData *platform)
{
    data->type = type;
    data->conn = conn;
    data->process_id = ctx->process_id;
    data->controlling_process_pid = term_invalid_term();
    data->port = 0;
    data->active = true;
    data->binary = true;
    data->buffer = 512;

    list_append(&platform->sockets_list_head, &data->sockets_head);

    data->passive_receiver_process_pid = term_invalid_term();
    data->passive_ref_ticks = 0;

    data->avail_bytes = 0;

    ctx->platform_data = data;
}

static struct TCPServerSocketData *tcp_server_socket_data_new(Context *ctx, struct netconn *conn,
    struct ESP32PlatformData *platform)
{
    struct TCPServerSocketData *tcp_data = malloc(sizeof(struct TCPServerSocketData));
    if (IS_NULL_PTR(tcp_data)) {
        return NULL;
    }
    socket_data_init(&tcp_data->socket_data, ctx, conn, TCPServerSocket, platform);
    tcp_data->ready_connections = 0;
    list_init(&tcp_data->accepters_list_head);

    return tcp_data;
}

static struct TCPClientSocketData *tcp_client_socket_data_new(Context *ctx, struct netconn *conn,
    struct ESP32PlatformData *platform, term controlling_process_pid)
{
    struct TCPClientSocketData *tcp_data = malloc(sizeof(struct TCPClientSocketData));
    if (IS_NULL_PTR(tcp_data)) {
        return NULL;
    }
    socket_data_init(&tcp_data->socket_data, ctx, conn, TCPClientSocket, platform);
    tcp_data->socket_data.controlling_process_pid = controlling_process_pid;

    return tcp_data;
}

static struct UDPSocketData *udp_socket_data_new(Context *ctx, struct netconn *conn,
    struct ESP32PlatformData *platform, term controlling_process_pid)
{
    struct UDPSocketData *udp_data = malloc(sizeof(struct UDPSocketData));
    if (IS_NULL_PTR(udp_data)) {
        return NULL;
    }
    socket_data_init(&udp_data->socket_data, ctx, conn, UDPSocket, platform);
    udp_data->socket_data.controlling_process_pid = controlling_process_pid;

    return udp_data;
}

static void send_message(term pid, term message, GlobalContext *global)
{
    int local_process_id = term_to_local_process_id(pid);
    Context *target = globalcontext_get_process_lock(global, local_process_id);
    mailbox_send(target, message);
    globalcontext_get_process_unlock(global, target);
}

void ESP_IRAM_ATTR socket_callback(struct netconn *netconn, enum netconn_evt evt, u16_t len)
{
    struct NetconnEvent event = {
        .netconn = netconn,
        .evt = evt,
        .len = len
    };

    BaseType_t xHigherPriorityTaskWoken;
    int result = xQueueSendFromISR(netconn_events, &event, &xHigherPriorityTaskWoken);
    if (result != pdTRUE) {
        fprintf(stderr, "socket: failed to enqueue: %i to netconn_events.\n", result);
    }

    void *netconn_events_ptr = &netconn_events;
    result = xQueueSendFromISR(event_queue, &netconn_events_ptr, &xHigherPriorityTaskWoken);
    if (result != pdTRUE) {
        fprintf(stderr, "socket: failed to enqueue: %i to event_queue.\n", result);
    }
}

term accept_conn(GlobalContext *glb, struct TCPServerSocketData *tcp_data, struct TCPServerAccepter *accepter)
{
    TRACE("Going to accept a TCP connection\n");

    struct ESP32PlatformData *platform = glb->platform_data;

    struct netconn *accepted_conn;
    err_t status = netconn_accept(tcp_data->socket_data.conn, &accepted_conn);
    if (UNLIKELY(status != ERR_OK)) {
        //TODO
        fprintf(stderr, "accept error: %i on %p\n", status, (void *) tcp_data->socket_data.conn);
        return term_invalid_term();
    }

    term pid = accepter->accepting_process_pid;

    TRACE("accepted conn: %p\n", (void *) accepted_conn);

    Context *new_ctx = context_new(glb);
    new_ctx->native_handler = socket_consume_mailbox;

    term socket_pid = term_from_local_process_id(new_ctx->process_id);

    struct TCPClientSocketData *new_tcp_data = tcp_client_socket_data_new(new_ctx, accepted_conn, platform, pid);
    if (IS_NULL_PTR(new_tcp_data)) {
        AVM_ABORT();
    }
    new_tcp_data->socket_data.active = tcp_data->socket_data.active;
    new_tcp_data->socket_data.binary = tcp_data->socket_data.binary;
    new_tcp_data->socket_data.buffer = tcp_data->socket_data.buffer;

    // TODO
    // We use new_ctx's heap as we know it is not running.
    if (UNLIKELY(memory_ensure_free(new_ctx, 128) != MEMORY_GC_OK)) {
        AVM_ABORT();
    }
    term ref = term_from_ref_ticks(accepter->ref_ticks, new_ctx);
    term return_tuple = term_alloc_tuple(2, new_ctx);

    free(accepter);

    term result_tuple = term_alloc_tuple(2, new_ctx);
    term_put_tuple_element(result_tuple, 0, OK_ATOM);
    term_put_tuple_element(result_tuple, 1, socket_pid);

    term_put_tuple_element(return_tuple, 0, ref);
    term_put_tuple_element(return_tuple, 1, result_tuple);

    return return_tuple;
}

static void do_accept(Context *ctx, term msg)
{
    struct TCPServerSocketData *tcp_data = ctx->platform_data;

    term pid = term_get_tuple_element(msg, 0);
    term ref = term_get_tuple_element(msg, 1);

