atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/socket_driver.c
    struct TCPServerAccepter *accepter = malloc(sizeof(struct TCPServerAccepter));
    accepter->accepting_process_pid = pid;
    accepter->ref_ticks = term_to_ref_ticks(ref);
    list_append(&tcp_data->accepters_list_head, &accepter->accepter_head);

    if (tcp_data->ready_connections) {
        TRACE("accepting existing connections.\n");

        struct ListHead *accepter_head;
        struct ListHead *tmp;
        struct TCPServerAccepter *accepter = NULL;
        MUTABLE_LIST_FOR_EACH (accepter_head, tmp, &tcp_data->accepters_list_head) {
            //TODO: check if is alive here
            if (1) {
                accepter = GET_LIST_ENTRY(accepter_head, struct TCPServerAccepter, accepter_head);
                list_remove(accepter_head);
            }
        }

        if (accepter) {
            GlobalContext *glb = ctx->global;
            term return_tuple = accept_conn(glb, tcp_data, accepter);
            if (!term_is_invalid_term(return_tuple)) {
                globalcontext_send_message(glb, accepter->accepting_process_pid, return_tuple);
            }
            tcp_data->ready_connections--;
        }
    }
}

static void close_tcp_socket_and_unlock(GlobalContext *glb, Context *ctx, struct TCPClientSocketData *tcp_data)
{
    term heap[3];
    term *heap_ptr = heap;
    term pid = tcp_data->socket_data.controlling_process_pid;
    term msg = term_heap_alloc_tuple(2, &heap_ptr);
    term_put_tuple_element(msg, 0, TCP_CLOSED_ATOM);
    term_put_tuple_element(msg, 1, term_from_local_process_id(ctx->process_id));

    err_t res = netconn_delete(tcp_data->socket_data.conn);
    if (res != ERR_OK) {
        TRACE("close_tcp_socket: netconn_delete failed");
    }
    tcp_data->socket_data.conn = NULL;
    list_remove(&tcp_data->socket_data.sockets_head);

    free(tcp_data);

    mailbox_send(ctx, globalcontext_make_atom(glb, close_internal));
    globalcontext_get_process_unlock(glb, ctx);
    send_message(pid, msg, glb);
}

static void tcp_client_handler(GlobalContext *glb, int32_t process_id)
{
    TRACE("tcp_client_handler\n");

    Context *ctx = globalcontext_get_process_lock(glb, process_id);
    if (UNLIKELY(ctx == NULL)) {
        return;
    }
    struct TCPClientSocketData *tcp_data = ctx->platform_data;

    if (!tcp_data->socket_data.active) {
        TRACE("tcp_client_handler: Not active socket.  Ignoring.\n");
        globalcontext_get_process_unlock(glb, ctx);
        return;
    }

    if (!tcp_data->socket_data.avail_bytes) {
        TRACE("tcp_client_handler: No bytes to receive.\n");
        // NB. When the connection peer closes a connection, then no avail_bytes
        // are reported.  We verify that this is the expected behavior.
        close_tcp_socket_and_unlock(glb, ctx, tcp_data);
        return;
    }

    struct netbuf *buf = NULL;
    err_t status = netconn_recv(tcp_data->socket_data.conn, &buf);
    if (UNLIKELY(status != ERR_OK)) {
        TRACE("tcp_client_handler: netconn_recv error: %i\n", status);
        close_tcp_socket_and_unlock(glb, ctx, tcp_data);
        return;
    }

    void *data;
    u16_t data_len;
    status = netbuf_data(buf, &data, &data_len);
    if (UNLIKELY(status != ERR_OK)) {
        TRACE("tcp_client_handler: netbuf_data error: %i\n", status);
        close_tcp_socket_and_unlock(glb, ctx, tcp_data);
        return;
    }

    tcp_data->socket_data.avail_bytes -= data_len;

    //HANDLE fragments here?

    TRACE("%*s\n", (int) data_len, (char *) data);

    int recv_terms_size;
    if (tcp_data->socket_data.binary) {
        recv_terms_size = term_binary_data_size_in_terms(data_len) + BINARY_HEADER_SIZE;
    } else {
        recv_terms_size = data_len * 2;
    }

    int tuples_size;
    if (tcp_data->socket_data.active) {
        // tuples_size = 5 (result_tuple size)
        tuples_size = 4;
    } else {
        // tuples_size = 3 (ok_tuple size) + 3 (result_tuple size) + (ref)
        tuples_size = 3 + 3 + REF_SIZE;
    }
    term heap[tuples_size + recv_terms_size];
    term *heap_ptr = heap;

    term recv_data;
    if (tcp_data->socket_data.binary) {
        recv_data = term_heap_create_uninitialized_binary(data_len, &heap_ptr);
        memcpy((void *) term_binary_data(recv_data), data, data_len);
    } else {
        recv_data = term_heap_from_string((const uint8_t *) data, data_len, &heap_ptr);
    }

    netbuf_delete(buf);

    term pid = tcp_data->socket_data.controlling_process_pid;

    term result_tuple;
    if (tcp_data->socket_data.active) {
        result_tuple = term_heap_alloc_tuple(3, &heap_ptr);
        term_put_tuple_element(result_tuple, 0, TCP_ATOM);
        term_put_tuple_element(result_tuple, 1, term_from_local_process_id(ctx->process_id));
        term_put_tuple_element(result_tuple, 2, recv_data);

    } else {
        term ok_tuple = term_heap_alloc_tuple(2, &heap_ptr);
        term_put_tuple_element(ok_tuple, 0, OK_ATOM);
        term_put_tuple_element(ok_tuple, 1, recv_data);

        result_tuple = term_heap_alloc_tuple(2, &heap_ptr);
        term_put_tuple_element(result_tuple, 0, term_heap_from_ref_ticks(tcp_data->socket_data.passive_ref_ticks, &heap_ptr));
        term_put_tuple_element(result_tuple, 1, ok_tuple);

        pid = tcp_data->socket_data.passive_receiver_process_pid;

        tcp_data->socket_data.passive_receiver_process_pid = term_invalid_term();
        tcp_data->socket_data.passive_ref_ticks = 0;
    }

    TRACE("sending received: ");
    #ifdef ENABLE_TRACE
        term_display(stdout, result_tuple, ctx);
    #endif
    TRACE(" to ");
     #ifdef ENABLE_TRACE
        term_display(stdout, pid, ctx);
    #endif
    TRACE("\n");

    // Unlock context (tcp_data is now unsafe)
    globalcontext_get_process_unlock(glb, ctx);

    send_message(pid, result_tuple, glb);
}

static void tcp_server_handler(GlobalContext *glb, int32_t process_id)
{
    TRACE("tcp_server_handler\n");

    Context *ctx = globalcontext_get_process_lock(glb, process_id);
    if (UNLIKELY(ctx == NULL)) {
        return;
    }

    struct TCPServerSocketData *tcp_data = ctx->platform_data;

    struct ListHead *accepter_head;
    struct ListHead *tmp;
    struct TCPServerAccepter *accepter = NULL;
    MUTABLE_LIST_FOR_EACH (accepter_head, tmp, &tcp_data->accepters_list_head) {
        //TODO: is alive here
        if (1) {
            accepter = GET_LIST_ENTRY(accepter_head, struct TCPServerAccepter, accepter_head);
            list_remove(accepter_head);
        }
    }

    if (accepter) {
        term return_tuple = accept_conn(glb, tcp_data, accepter);
        int32_t process_id = accepter->accepting_process_pid;
        globalcontext_get_process_unlock(glb, ctx);
        globalcontext_send_message(glb, process_id, return_tuple);
    } else {
        tcp_data->ready_connections++;
        globalcontext_get_process_unlock(glb, ctx);
    }
}

static void udp_handler(GlobalContext *glb, int32_t process_id)
{
    TRACE("udp_client_handler\n");

