atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/socket_driver.c
    Context *ctx = globalcontext_get_process_lock(glb, process_id);
    if (UNLIKELY(ctx == NULL)) {
        return;
    }

    struct UDPSocketData *udp_data = ctx->platform_data;

    struct SocketData *socket_data = &udp_data->socket_data;
    if (!socket_data->active && (socket_data->passive_receiver_process_pid == term_invalid_term())) {
        globalcontext_get_process_unlock(glb, ctx);
        return;
    }

    if (!udp_data->socket_data.avail_bytes) {
        TRACE("No bytes to receive.\n");
        globalcontext_get_process_unlock(glb, ctx);
        return;
    }

    struct netbuf *buf = NULL;
    err_t status = netconn_recv(udp_data->socket_data.conn, &buf);
    if (UNLIKELY(status != ERR_OK)) {
        //TODO
        fprintf(stderr, "tcp_client_handler error: %i\n", status);
        globalcontext_get_process_unlock(glb, ctx);
        return;
    }

    void *data;
    u16_t data_len;
    status = netbuf_data(buf, &data, &data_len);
    if (UNLIKELY(status != ERR_OK)) {
        //TODO
        fprintf(stderr, "netbuf_data error: %i\n", status);
        globalcontext_get_process_unlock(glb, ctx);
        return;
    }

    udp_data->socket_data.avail_bytes -= data_len;

    //HANDLE fragments here?

    TRACE("%*s\n", (int) data_len, (char *) data);

    int recv_terms_size;
    if (udp_data->socket_data.binary) {
        recv_terms_size = term_binary_data_size_in_terms(data_len) + BINARY_HEADER_SIZE;
    } else {
        recv_terms_size = data_len * 2;
    }

    int tuples_size;
    if (socket_data->active) {
        // tuples_size = 5 (addr size) + 6 (result_tuple size)
        tuples_size = 5 + 6;
    } else {
        // tuples_size = 4 (recv_ret size) + 5 (addr size) + 3 (ok_tuple size) + 3 (result_tuple size)
        tuples_size = 4 + 5 + 3 + 3 + REF_SIZE;
    }
    term heap[tuples_size + recv_terms_size];
    term *heap_ptr = heap;

    term recv_data;
    if (udp_data->socket_data.binary) {
        recv_data = term_heap_create_uninitialized_binary(data_len, &heap_ptr);
        memcpy((void *) term_binary_data(recv_data), data, data_len);
    } else {
        recv_data = term_heap_from_string((const uint8_t *) data, data_len, &heap_ptr);
    }

    term addr = socket_heap_addr_to_tuple(&heap_ptr, netbuf_fromaddr(buf));
    term port = term_from_int32(netbuf_fromport(buf));

    netbuf_delete(buf);

    term pid = udp_data->socket_data.controlling_process_pid;

    term result_tuple;
    if (socket_data->active) {
        result_tuple = term_heap_alloc_tuple(5, &heap_ptr);
        term_put_tuple_element(result_tuple, 0, UDP_ATOM);
        term_put_tuple_element(result_tuple, 1, term_from_local_process_id(ctx->process_id));
        term_put_tuple_element(result_tuple, 2, addr);
        term_put_tuple_element(result_tuple, 3, port);
        term_put_tuple_element(result_tuple, 4, recv_data);

    } else {
        term recv_ret = term_heap_alloc_tuple(3, &heap_ptr);
        term_put_tuple_element(recv_ret, 0, addr);
        term_put_tuple_element(recv_ret, 1, port);
        term_put_tuple_element(recv_ret, 2, recv_data);

        term ok_tuple = term_heap_alloc_tuple(2, &heap_ptr);
        term_put_tuple_element(ok_tuple, 0, OK_ATOM);
        term_put_tuple_element(ok_tuple, 1, recv_ret);

        result_tuple = term_heap_alloc_tuple(2, &heap_ptr);
        term_put_tuple_element(result_tuple, 0, term_heap_from_ref_ticks(socket_data->passive_ref_ticks, &heap_ptr));
        term_put_tuple_element(result_tuple, 1, ok_tuple);

        pid = socket_data->passive_receiver_process_pid;

        socket_data->passive_receiver_process_pid = term_invalid_term();
        socket_data->passive_ref_ticks = 0;
    }

    TRACE("sending received: ");
    #ifdef ENABLE_TRACE
        term_display(stdout, result_tuple, ctx);
    #endif
    TRACE(" to ");
     #ifdef ENABLE_TRACE
        term_display(stdout, pid, ctx);
    #endif
    TRACE("\n");

    globalcontext_get_process_unlock(glb, ctx);

    send_message(pid, result_tuple, glb);
}

static bool bool_term_to_bool(term b, bool *ok)
{
    switch (b) {
        case TRUE_ATOM:
            *ok = true;
            return true;

        case FALSE_ATOM:
            *ok = true;
            return false;

        default:
            return false;
            *ok = false;
    }
}

static void do_connect(Context *ctx, term msg)
{
    GlobalContext *glb = ctx->global;
    struct ESP32PlatformData *platform = glb->platform_data;

    term cmd = term_get_tuple_element(msg, 2);
    term params = term_get_tuple_element(cmd, 1);

    term address_term = interop_proplist_get_value(params, ADDRESS_ATOM);
    term port_term = interop_proplist_get_value(params, PORT_ATOM);
    term binary_term = interop_proplist_get_value(params, BINARY_ATOM);
    term active_term = interop_proplist_get_value(params, ACTIVE_ATOM);
    term controlling_process_term = interop_proplist_get_value(params, CONTROLLING_PROCESS_ATOM);

    int ok_int;
    char *address_string = interop_term_to_string(address_term, &ok_int);
    if (UNLIKELY(!ok_int)) {
        AVM_ABORT();
    }

    avm_int_t port = term_to_int(port_term);
    bool ok;
    bool active = bool_term_to_bool(active_term, &ok);
    if (UNLIKELY(!ok)) {
        AVM_ABORT();
    }
    bool binary = bool_term_to_bool(binary_term, &ok);
    if (UNLIKELY(!ok)) {
        AVM_ABORT();
    }

    TRACE("tcp: connecting to: %s\n", address_string);

    struct ip_addr remote_ip;
    //TODO: use dns_gethostbyname instead
    err_t status = netconn_gethostbyname(address_string, &remote_ip);
    if (UNLIKELY(status != ERR_OK)) {
        free(address_string);
        TRACE("tcp: host resolution failed.\n");
        return;
    }

    TRACE("tcp: host resolved.\n");

    free(address_string);

    struct netconn *conn = netconn_new_with_proto_and_callback(NETCONN_TCP, 0, socket_callback);
    if (IS_NULL_PTR(conn)) {
        AVM_ABORT();
    }

    status = netconn_connect(conn, &remote_ip, port);
    if (UNLIKELY(status != ERR_OK)) {
        TRACE("tcp: failed connect: %i\n", status);
        return;
    }

    TRACE("tcp: connected.\n");

