atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/socket_driver.c
    size_t buffer_size;
    switch (interop_iolist_size(data, &buffer_size)) {
        case InteropOk:
            break;
        case InteropMemoryAllocFail:
            fprintf(stderr, "error: failed alloc.\n");
            return;
        case InteropBadArg:
            fprintf(stderr, "error: invalid iolist.\n");
            return;
    }
    void *buffer = malloc(buffer_size);
    switch (interop_write_iolist(data, buffer)) {
        case InteropOk:
            break;
        case InteropMemoryAllocFail:
            free(buffer);
            fprintf(stderr, "error: failed alloc.\n");
            return;
        case InteropBadArg:
            free(buffer);
            fprintf(stderr, "error: invalid iolist.\n");
            return;
    }
    err_t status = netconn_write(tcp_data->socket_data.conn, buffer, buffer_size, NETCONN_NOCOPY);
    if (UNLIKELY(status != ERR_OK)) {
        fprintf(stderr, "write error: %i\n", status);
        return;
    }

    free(buffer);

    if (UNLIKELY(memory_ensure_free(ctx, 3) != MEMORY_GC_OK)) {
        AVM_ABORT();
    }
    term return_tuple = term_alloc_tuple(2, ctx);

    term_put_tuple_element(return_tuple, 0, ref);
    term_put_tuple_element(return_tuple, 1, OK_ATOM);

    send_message(pid, return_tuple, glb);
}

static void do_sendto(Context *ctx, term msg)
{
    GlobalContext *glb = ctx->global;
    struct UDPSocketData *udp_data = ctx->platform_data;

    term pid = term_get_tuple_element(msg, 0);
    term ref = term_get_tuple_element(msg, 1);
    term cmd = term_get_tuple_element(msg, 2);

    term dest_addr_term = term_get_tuple_element(cmd, 1);
    term dest_port_term = term_get_tuple_element(cmd, 2);
    term data = term_get_tuple_element(cmd, 3);

    size_t buffer_size;
    switch (interop_iolist_size(data, &buffer_size)) {
        case InteropOk:
            break;
        case InteropMemoryAllocFail:
            fprintf(stderr, "error: failed alloc.\n");
            return;
        case InteropBadArg:
            fprintf(stderr, "error: invalid iolist.\n");
            return;
    }
    void *buffer = malloc(buffer_size);
    switch (interop_write_iolist(data, buffer)) {
        case InteropOk:
            break;
        case InteropMemoryAllocFail:
            free(buffer);
            fprintf(stderr, "error: failed alloc.\n");
            return;
        case InteropBadArg:
            free(buffer);
            fprintf(stderr, "error: invalid iolist.\n");
            return;
    }

    ip_addr_t ip4addr;
    tuple_to_ip_addr(dest_addr_term, &ip4addr);
    uint16_t destport = term_to_int32(dest_port_term);

    struct netbuf *sendbuf = netbuf_new();

    err_t status = netbuf_ref(sendbuf, buffer, buffer_size);
    if (UNLIKELY(status != ERR_OK)) {
        fprintf(stderr, "netbuf_ref error: %i\n", status);
        netbuf_delete(sendbuf);
        return;
    }

    status = netconn_sendto(udp_data->socket_data.conn, sendbuf, &ip4addr, destport);
    if (UNLIKELY(status != ERR_OK)) {
        fprintf(stderr, "netbuf_ref error: %i\n", status);
        netbuf_delete(sendbuf);
        return;
    }

    netbuf_delete(sendbuf);
    free(buffer);

    if (UNLIKELY(memory_ensure_free(ctx, 3) != MEMORY_GC_OK)) {
        AVM_ABORT();
    }
    term return_tuple = term_alloc_tuple(2, ctx);

    term_put_tuple_element(return_tuple, 0, ref);
    term_put_tuple_element(return_tuple, 1, OK_ATOM);

    send_message(pid, return_tuple, glb);
}

static void do_close(Context *ctx, term msg)
{
    GlobalContext *glb = ctx->global;
    struct TCPServerSocketData *tcp_data = ctx->platform_data;

    term pid = term_get_tuple_element(msg, 0);
    term ref = term_get_tuple_element(msg, 1);

    err_t res = netconn_delete(tcp_data->socket_data.conn);
    if (res != ERR_OK) {
        TRACE("socket: close failed");
        return;
    }
    //TODO
    tcp_data->socket_data.conn = NULL;
    list_remove(&tcp_data->socket_data.sockets_head);

    if (UNLIKELY(memory_ensure_free(ctx, 3) != MEMORY_GC_OK)) {
        AVM_ABORT();
    }
    term return_tuple = term_alloc_tuple(2, ctx);

    term_put_tuple_element(return_tuple, 0, ref);
    term_put_tuple_element(return_tuple, 1, OK_ATOM);

    send_message(pid, return_tuple, glb);

    free(tcp_data);
}

static void do_recvfrom(Context *ctx, term msg)
{
    GlobalContext *glb = ctx->global;
    struct SocketData *socket_data = ctx->platform_data;

    term pid = term_get_tuple_element(msg, 0);
    term ref = term_get_tuple_element(msg, 1);

    if (socket_data->passive_receiver_process_pid != term_invalid_term()) {
        // 3 (error_tuple) + 3 (result_tuple)
        if (UNLIKELY(memory_ensure_free(ctx, 3 + 3) != MEMORY_GC_OK)) {
            AVM_ABORT();
        }

        term ealready = globalcontext_make_atom(glb, ealready_atom);

        term error_tuple = term_alloc_tuple(2, ctx);
        term_put_tuple_element(error_tuple, 0, ERROR_ATOM);
        term_put_tuple_element(error_tuple, 1, ealready);

        term result_tuple = term_alloc_tuple(2, ctx);
        term_put_tuple_element(result_tuple, 0, ref);
        term_put_tuple_element(result_tuple, 1, error_tuple);

        send_message(pid, result_tuple, glb);
    }

    if (socket_data->avail_bytes) {
        TRACE("do_recvfrom: have already ready bytes.\n");

        struct netbuf *buf = NULL;
        err_t status = netconn_recv(socket_data->conn, &buf);
        if (UNLIKELY(status != ERR_OK)) {
            //TODO
            fprintf(stderr, "do_recvfrom: netconn_recv error: %i\n", status);
            return;
        }

        void *data;
        u16_t data_len;
        status = netbuf_data(buf, &data, &data_len);
        if (UNLIKELY(status != ERR_OK)) {
            //TODO
            fprintf(stderr, "do_recvfrom: netbuf_data error: %i\n", status);
            return;
        }

        socket_data->avail_bytes -= data_len;

        //HANDLE fragments here?

        TRACE("%*s\n", (int) data_len, (char *) data);

        int recv_terms_size;
        if (socket_data->binary) {
            recv_terms_size = term_binary_data_size_in_terms(data_len) + BINARY_HEADER_SIZE;
        } else {
            recv_terms_size = data_len * 2;
        }

        // 4 (recv_ret size) + 3 (ok_tuple size) + 3 (result_tuple size) + recv_terms_size
        if (UNLIKELY(memory_ensure_free(ctx, 4 + 3 + 3 + recv_terms_size) != MEMORY_GC_OK)) {
            AVM_ABORT();
        }

        term recv_data;
        if (socket_data->binary) {
            recv_data = term_create_uninitialized_binary(data_len, ctx);
            memcpy((void *) term_binary_data(recv_data), data, data_len);
        } else {
            recv_data = term_from_string((const uint8_t *) data, data_len, ctx);
        }

        term addr = socket_ctx_addr_to_tuple(ctx, netbuf_fromaddr(buf));
        term port = term_from_int32(netbuf_fromport(buf));

        netbuf_delete(buf);

        term recv_ret = term_alloc_tuple(3, ctx);
        term_put_tuple_element(recv_ret, 0, addr);
        term_put_tuple_element(recv_ret, 1, port);
        term_put_tuple_element(recv_ret, 2, recv_data);

