atomvm/AtomVM/src/platforms/esp32/components/avm_builtins/socket_driver.c
        term ok_tuple = term_alloc_tuple(2, ctx);
        term_put_tuple_element(ok_tuple, 0, OK_ATOM);
        term_put_tuple_element(ok_tuple, 1, recv_ret);

        term result_tuple = term_alloc_tuple(2, ctx);
        term_put_tuple_element(result_tuple, 0, ref);
        term_put_tuple_element(result_tuple, 1, ok_tuple);

        send_message(pid, result_tuple, glb);

    } else {
        socket_data->passive_receiver_process_pid = pid;
        socket_data->passive_ref_ticks = term_to_ref_ticks(ref);
    }
}

static void do_get_port(Context *ctx, term msg)
{
    GlobalContext *glb = ctx->global;
    struct SocketData *socket_data = ctx->platform_data;

    term pid = term_get_tuple_element(msg, 0);
    term ref = term_get_tuple_element(msg, 1);

    // 3 (error_ok_tuple) + 3 (result_tuple)
    if (UNLIKELY(memory_ensure_free(ctx, 3 + 3) != MEMORY_GC_OK)) {
        AVM_ABORT();
    }

    term error_ok_tuple = term_alloc_tuple(2, ctx);
    if (socket_data->port != 0) {
        term_put_tuple_element(error_ok_tuple, 0, OK_ATOM);
        term_put_tuple_element(error_ok_tuple, 1, term_from_int(socket_data->port));
    } else {
        term_put_tuple_element(error_ok_tuple, 0, ERROR_ATOM);
        term_put_tuple_element(error_ok_tuple, 1, BADARG_ATOM);
    }

    term result_tuple = term_alloc_tuple(2, ctx);
    term_put_tuple_element(result_tuple, 0, ref);
    term_put_tuple_element(result_tuple, 1, error_ok_tuple);

    send_message(pid, result_tuple, glb);
}

static void do_sockname(Context *ctx, term msg)
{
    GlobalContext *glb = ctx->global;
    struct SocketData *socket_data = ctx->platform_data;

    term pid = term_get_tuple_element(msg, 0);
    term ref = term_get_tuple_element(msg, 1);

    ip_addr_t addr;
    u16_t port;
    err_t result = netconn_addr(socket_data->conn, &addr, &port);
    term return_msg;
    if (result != ERR_OK) {
        if (UNLIKELY(memory_ensure_free(ctx, 3 + 3) != MEMORY_GC_OK)) {
            AVM_ABORT();
        }
        return_msg = term_alloc_tuple(2, ctx);
        term_put_tuple_element(return_msg, 0, ERROR_ATOM);
        term_put_tuple_element(return_msg, 1, term_from_int(result));
    } else {
        if (UNLIKELY(memory_ensure_free(ctx, 3 + 3 + 8) != MEMORY_GC_OK)) {
            AVM_ABORT();
        }
        return_msg = term_alloc_tuple(2, ctx);
        term addr_term = socket_ctx_addr_to_tuple(ctx, &addr);
        term port_term = term_from_int(port);
        term address_port_term = term_alloc_tuple(2, ctx);
        term_put_tuple_element(address_port_term, 0, addr_term);
        term_put_tuple_element(address_port_term, 1, port_term);
        term_put_tuple_element(return_msg, 0, OK_ATOM);
        term_put_tuple_element(return_msg, 1, address_port_term);
    }

    term result_tuple = term_alloc_tuple(2, ctx);
    term_put_tuple_element(result_tuple, 0, ref);
    term_put_tuple_element(result_tuple, 1, return_msg);
    send_message(pid, result_tuple, glb);
}

static void do_peername(Context *ctx, term msg)
{
    GlobalContext *glb = ctx->global;
    struct SocketData *socket_data = ctx->platform_data;

    term pid = term_get_tuple_element(msg, 0);
    term ref = term_get_tuple_element(msg, 1);

    ip_addr_t addr;
    u16_t port;
    err_t result = netconn_peer(socket_data->conn, &addr, &port);
    term return_msg;
    if (result != ERR_OK) {
        if (UNLIKELY(memory_ensure_free(ctx, 3 + 3) != MEMORY_GC_OK)) {
            AVM_ABORT();
        }
        return_msg = term_alloc_tuple(2, ctx);
        term_put_tuple_element(return_msg, 0, ERROR_ATOM);
        term_put_tuple_element(return_msg, 1, term_from_int(result));
    } else {
        if (UNLIKELY(memory_ensure_free(ctx, 3 + 3 + 8) != MEMORY_GC_OK)) {
            AVM_ABORT();
        }
        return_msg = term_alloc_tuple(2, ctx);
        term addr_term = socket_ctx_addr_to_tuple(ctx, &addr);
        term port_term = term_from_int(port);
        term address_port_term = term_alloc_tuple(2, ctx);
        term_put_tuple_element(address_port_term, 0, addr_term);
        term_put_tuple_element(address_port_term, 1, port_term);
        term_put_tuple_element(return_msg, 0, OK_ATOM);
        term_put_tuple_element(return_msg, 1, address_port_term);
    }

    term result_tuple = term_alloc_tuple(2, ctx);
    term_put_tuple_element(result_tuple, 0, ref);
    term_put_tuple_element(result_tuple, 1, return_msg);
    send_message(pid, result_tuple, glb);
}

static void do_controlling_process(Context *ctx, term msg)
{
    GlobalContext *glb = ctx->global;
    struct SocketData *socket_data = ctx->platform_data;

    term pid = term_get_tuple_element(msg, 0);
    term ref = term_get_tuple_element(msg, 1);
    term cmd = term_get_tuple_element(msg, 2);

    term new_pid_term = term_get_tuple_element(cmd, 1);
    term return_msg;

    if (UNLIKELY(memory_ensure_free(ctx, TUPLE_SIZE(2) + TUPLE_SIZE(2)) != MEMORY_GC_OK)) {
        AVM_ABORT();
    }

    if (UNLIKELY(!term_is_pid(new_pid_term))) {
        return_msg = term_alloc_tuple(2, ctx);
        term_put_tuple_element(return_msg, 0, ERROR_ATOM);
        term_put_tuple_element(return_msg, 1, BADARG_ATOM);
    } else if (UNLIKELY(pid != socket_data->controlling_process_pid)) {
        return_msg = term_alloc_tuple(2, ctx);
        term_put_tuple_element(return_msg, 0, ERROR_ATOM);
        term_put_tuple_element(return_msg, 1, NOT_OWNER_ATOM);
    } else {
        socket_data->controlling_process_pid = new_pid_term;
        return_msg = OK_ATOM;
    }

    term result_tuple = term_alloc_tuple(2, ctx);
    term_put_tuple_element(result_tuple, 0, ref);
    term_put_tuple_element(result_tuple, 1, return_msg);
    send_message(pid, result_tuple, glb);
}

static NativeHandlerResult socket_consume_mailbox(Context *ctx)
{
    GlobalContext *glb = ctx->global;

    while (mailbox_has_next(&ctx->mailbox)) {
        Message *message = mailbox_first(&ctx->mailbox);
        term msg = message->message;

        TRACE("message: ");
        #ifdef ENABLE_TRACE
            term_display(stdout, msg, ctx);
        #endif
        TRACE("\n");

        if (msg == globalcontext_make_atom(glb, close_internal)) {
            // We don't need to remove message.
            return false;
        }

        term cmd = term_get_tuple_element(msg, 2);
        term cmd_name = term_get_tuple_element(cmd, 0);

        switch (cmd_name) {
            //TODO: remove this
            case INIT_ATOM:
                TRACE("init\n");
                do_init(ctx, msg);
                break;

            case SENDTO_ATOM:
                TRACE("sendto\n");
                do_sendto(ctx, msg);
                break;

